In [ ]:
# Importing course packages; you can add more too!
import pandas as pd
import numpy as np
import datetime as dt


# Importing course datasets as DataFrames
banking = pd.read_csv('.../banking_dirty.csv', index_col = 'Unnamed: 0')

# Cleaning Data Set 3: Some dirty banking data

In [ ]:
# Let's inspect the data

banking.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 99
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   cust_id           100 non-null    object
 1   birth_date        100 non-null    object
 2   Age               100 non-null    int64
 3   acct_amount       100 non-null    float64
 4   inv_amount        100 non-null    int64
 5   fund_A            100 non-null    float64
 6   fund_B            100 non-null    float64
 7   fund_C            100 non-null    float64
 8   fund_D            100 non-null    float64
 9   account_opened    100 non-null    object
 10  last_transaction  100 non-null    object
dtypes: float64(5), int64(2), object(4)
memory usage: 9.4+ KB

## Banking Summary
The banking data set consists of 100 customers. It contains 11 varialbes. They consist of a customer id, customer birthday, customer age, current amount, investment amount, 4 funds that the current amount could be spread across, when the account was opened, and the last transation date. By this view, we should have 1 object, 3 date, 1 integer, and 6 float data types. Based upon the info provided, we have some work to do. All three date columns need need to be changed to dates. Two of the date columns need reformatting. After working on the dates, we will verify the 'age' column is current based on the 'birth_date' column. Finally, we will make sure all the floats have two decimal places after changing 'inv_amount' to a float.

In [ ]:
banking.head(10)

,cust_id,birth_date,Age,acct_amount,inv_amount,fund_A,fund_B,fund_C,fund_D,account_opened,last_transaction
0,870A9281,1962-06-09,58,"63,523.31",51295,"30,105.00","4,138.00","1,420.00","15,632.00",02-09-18,22-02-19
1,166B05B0,1962-12-16,58,"38,175.46",15050,"4,995.00",938.00,"6,696.00","2,421.00",28-02-19,31-10-18
2,BFC13E88,1990-09-12,34,"59,863.77",24567,"10,323.00","4,590.00","8,469.00","1,185.00",25-04-18,02-04-18
3,F2158F66,1985-11-03,35,"84,132.10",23712,"3,908.00",492.00,"6,482.00","12,830.00",07-11-17,08-11-18
4,7A73F334,1990-05-17,30,"120,512.00",93230,"12,158.40","51,281.00","13,434.00","18,383.00",14-05-18,19-07-18
5,472341F2,1980-02-23,40,"83,127.65",67960,"12,686.00","19,776.00","23,707.00","11,791.00",14-12-18,22-04-18
6,6B094617,1977-08-26,43,"89,855.98",34549,"1,796.00",312.00,"20,610.00","11,831.00",06-02-18,14-02-19
7,80C0DAB3,1963-10-14,57,"73,951.45",61649,"15,290.00","3,991.00","36,728.00","5,640.00",03-04-17,21-09-19
8,E52D4C7F,1975-06-05,49,"61,795.89",49385,"12,939.00","7,757.00","12,569.00","16,120.00",22-05-17,24-10-19
9,BD7CF5D7,1965-01-04,55,"82,084.76",44338,"18,966.00",523.00,"4,903.00","19,946.00",18-07-17,26-02-20

In [ ]:
# Playing with some dates
# 'birth_date' Column

banking['birth_date'] = pd.to_datetime(banking['birth_date'])

banking.head()

,cust_id,birth_date,Age,acct_amount,inv_amount,fund_A,fund_B,fund_C,fund_D,account_opened,last_transaction
0,870A9281,1962-06-09,58,"63,523.31",51295,"30,105.00","4,138.00","1,420.00","15,632.00",02-09-18,22-02-19
1,166B05B0,1962-12-16,58,"38,175.46",15050,"4,995.00",938.00,"6,696.00","2,421.00",28-02-19,31-10-18
2,BFC13E88,1990-09-12,34,"59,863.77",24567,"10,323.00","4,590.00","8,469.00","1,185.00",25-04-18,02-04-18
3,F2158F66,1985-11-03,35,"84,132.10",23712,"3,908.00",492.00,"6,482.00","12,830.00",07-11-17,08-11-18
4,7A73F334,1990-05-17,30,"120,512.00",93230,"12,158.40","51,281.00","13,434.00","18,383.00",14-05-18,19-07-18

In [ ]:
# If you look at the format of 'account_opened' and 'last_transaction', you will see that they are in the format dd-mm-yy. Nothing is inherently wrong with that format until you try to convert it with pd.to_datetime(). It will transition the year to the front, the day will become the month, and the month the day. To solve this, when we call pd.to_datetime() we need to tell Pandas what format to look for.

# If you are following along, the code for these two variables will turn them into a datetime and then back into an object. 
banking['account_opened'] = pd.to_datetime(banking['account_opened'], format="%d-%m-%y")
banking['account_opened'] = banking['account_opened'].dt.strftime('%Y-%m-%d')
banking.head()

,cust_id,birth_date,Age,acct_amount,inv_amount,fund_A,fund_B,fund_C,fund_D,account_opened,last_transaction
0,870A9281,1962-06-09,58,"63,523.31",51295,"30,105.00","4,138.00","1,420.00","15,632.00",2018-09-02,22-02-19
1,166B05B0,1962-12-16,58,"38,175.46",15050,"4,995.00",938.00,"6,696.00","2,421.00",2019-02-28,31-10-18
2,BFC13E88,1990-09-12,34,"59,863.77",24567,"10,323.00","4,590.00","8,469.00","1,185.00",2018-04-25,02-04-18
3,F2158F66,1985-11-03,35,"84,132.10",23712,"3,908.00",492.00,"6,482.00","12,830.00",2017-11-07,08-11-18
4,7A73F334,1990-05-17,30,"120,512.00",93230,"12,158.40","51,281.00","13,434.00","18,383.00",2018-05-14,19-07-18

In [ ]:
banking['last_transaction'] = pd.to_datetime(banking['last_transaction'], format="%d-%m-%y")
banking['last_transaction'] = banking['last_transaction'].dt.strftime('%Y-%m-%d')
banking.head()

,cust_id,birth_date,Age,acct_amount,inv_amount,fund_A,fund_B,fund_C,fund_D,account_opened,last_transaction
0,870A9281,1962-06-09,58,"63,523.31",51295,"30,105.00","4,138.00","1,420.00","15,632.00",2018-09-02,2019-02-22
1,166B05B0,1962-12-16,58,"38,175.46",15050,"4,995.00",938.00,"6,696.00","2,421.00",2019-02-28,2018-10-31
2,BFC13E88,1990-09-12,34,"59,863.77",24567,"10,323.00","4,590.00","8,469.00","1,185.00",2018-04-25,2018-04-02
3,F2158F66,1985-11-03,35,"84,132.10",23712,"3,908.00",492.00,"6,482.00","12,830.00",2017-11-07,2018-11-08
4,7A73F334,1990-05-17,30,"120,512.00",93230,"12,158.40","51,281.00","13,434.00","18,383.00",2018-05-14,2018-07-19

In [ ]:
# Here we will check to see if any dates for 'last_transaction' are less than the date the account 
fishy_accounts = banking['account_opened'] < banking['last_transaction']
fishy_accounts.value_counts()

True     88
False    12
dtype: int64

In [ ]:
# Here we will transpose the fishy accounts by replacing the faulty 'last_transaction' dates with the 'account_opened' dates. The ideal way to do this is by talking to someone with access to the accounts and getting the correct dates. Since this is all simulated, we will utilized this method instead while calling it good enough for any purposes we may need. The idea is to have all True at the end. A key aspect is to remember that some dates now will equal one another, so be sure to have <= in this instance.

banking.loc[banking.last_transaction < banking.account_opened, 'last_transaction'] = banking.account_opened
check_accounts = banking['account_opened'] <= banking['last_transaction']
check_accounts.value_counts()

True    100
dtype: int64

In [ ]:
# Time to check if the ages match the 'birth_date'. The idea here is to check and make sure that the account owners age equals the year the account owner was born. Some simple math and cross column validation will be done. If you have not already converted the 'birth_date' column to a date, do so now by utilizing the example provided earlier in this tutorial.

# Step 1: Get today's date.
today = dt.date.today()

# Step 2: Calculate the difference for each row in the format of today - 'birth_date'
age_cal = today.year - banking['birth_date'].dt.year

# Step 3: Get the instances where the years equal each other.
equal_age = age_cal == banking['Age']

#Step 4: Count the inconsistencies. Since this is an old dataset, it will be 100% wrong.
equal_age.value_counts()

#Step 5: Transpose the 'Age' with the actual age.
banking.Age = age_cal

#Step 6: Recheck
equal_age = age_cal == banking['Age']
equal_age.value_counts()

True    100
dtype: int64

In [ ]:
# Change 'inv_amount' to float.
banking.inv_amount = banking.inv_amount.astype('float')

banking.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 99
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   cust_id           100 non-null    object
 1   birth_date        100 non-null    datetime64[ns]
 2   Age               100 non-null    int64
 3   acct_amount       100 non-null    float64
 4   inv_amount        100 non-null    float64
 5   fund_A            100 non-null    float64
 6   fund_B            100 non-null    float64
 7   fund_C            100 non-null    float64
 8   fund_D            100 non-null    float64
 9   account_opened    100 non-null    object
 10  last_transaction  100 non-null    object
dtypes: datetime64[ns](1), float64(6), int64(1), object(3)
memory usage: 13.4+ KB

In [ ]:
# Conclusion:

banking.head()

,cust_id,birth_date,Age,acct_amount,inv_amount,fund_A,fund_B,fund_C,fund_D,account_opened,last_transaction
0,870A9281,1962-06-09,60,"63,523.31","51,295.00","30,105.00","4,138.00","1,420.00","15,632.00",2018-09-02,2019-02-22
1,166B05B0,1962-12-16,60,"38,175.46","15,050.00","4,995.00",938.00,"6,696.00","2,421.00",2019-02-28,2019-02-28
2,BFC13E88,1990-09-12,32,"59,863.77","24,567.00","10,323.00","4,590.00","8,469.00","1,185.00",2018-04-25,2018-04-25
3,F2158F66,1985-11-03,37,"84,132.10","23,712.00","3,908.00",492.00,"6,482.00","12,830.00",2017-11-07,2018-11-08
4,7A73F334,1990-05-17,32,"120,512.00","93,230.00","12,158.40","51,281.00","13,434.00","18,383.00",2018-05-14,2018-07-19

# Conclusion